[
    {
        "id": 1,
        "name": "CB 120231", 
        "summary": ["The City of Seattle is authorizing an agreement with the Seattle Fire Chiefs Association to provide additional support to City employees who are essential in delivering critical services during the COVID-19 pandemic.",
                    "This agreement acknowledges the challenges faced by City employees, such as limited access to childcare and public transit, and aims to retain them by bolstering their morale and recognizing their extraordinary efforts.",
                    "The cost resulting from the agreement will be covered by General Fund reserves, which are funds set aside for City expenses. Subsequent legislation will appropriate the necessary funds once the departmental totals and payment timing are settled.",
                    "This ordinance ratifies and confirms certain prior acts consistent with its authority and will take effect 30 days after approval by the Mayor or as provided by Seattle Municipal Code Section 1.04.020]."],
        "link": "https://seattle.legistar.com/LegislationDetail.aspx?ID=5255246&GUID=A6DC99B4-4775-471C-A03A-8D20661856C8&Options=ID%7CText%7C&Search=CB+120231&FullText=1", 
        "votes": [
            {
                "name": "Lisa Herbold",
                "vote": "Approve"
            },
            {
                "name": "Tammy J. Morales",
                "vote": "Approve"
            },
            {
                "name": "Kshama Sawant",
                "vote": "Reject"
            },
            {
                "name": "Alex Pedersen",
                "vote": "Approve"
            },
            {
                "name": "Debora Juarez",
                "vote": "Reject"
            },
            {
                "name": "Dan Strauss",
                "vote": "Approve"
            },
            {
                "name": "Andrew J. Lewis",
                "vote": "Approve"
            },
            {
                "name": "Teresa Mosqueda",
                "vote": "Approve"
            },
            {
                "name": "Sara Nelson",
                "vote": "Reject"
            }
        ],
        "decision": "Approve",
        "keywords": ["Fire Fighters"],
        "bid": 1
    },
    {
        "id": 2, 
        "name": "CB 120374", 
        "summary": ["This ordinance adds protections against discrimination based on an individual's actual, potential, perceived, or alleged pregnancy outcomes in Seattle Municipal Code.",
                    "The ordinance responds to the U.S. Supreme Court's decision in Dobbs v. Jackson Women's Health Organization, which overruled the constitutional right to an abortion established by Roe v. Wade and Planned Parenthood of Southeastern Pa. v. Casey.",
                    "The ordinance acknowledges the Reproductive Privacy Act of Washington and the disproportionate impact that restricting and/or denying access to abortion services will have on poor communities and BIPOC communities.",
                    "The ordinance recognizes the fundamental right to bodily autonomy, including for transgender and gender diverse communities who face increased barriers and stigma when accessing abortion services, and commits to a city that does not subject its residents, workers, and visitors to discriminatory treatment."],
        "link": "https://seattle.legistar.com/LegislationDetail.aspx?ID=5729578&GUID=783AFBB0-296B-4724-8299-44CEEEB85010&Options=ID%7CText%7C&Search=CB+120374&FullText=1", 
        "votes": [
            {
                "name": "Tammy J. Morales",
                "vote": "Approve"
            },
            {
                "name": "Kshama Sawant",
                "vote": "Approve"
            },
            {
                "name": "Debora Juarez",
                "vote": "Reject"
            },
            {
                "name": "Dan Strauss",
                "vote": "Approve"
            },
            {
                "name": "Andrew J. Lewis",
                "vote": "Approve"
            },
            {
                "name": "Sara Nelson",
                "vote": "Reject"
            }
        ],
        "decision": "Approve",
        "keywords": ["Discrimination, Human Rights, Pregnancy, Pregnancy Outcomes"],
        "bid": 2
    },
    {
        "id": 3,
        "name": "CB 120337", 
        "summary": ["The new ordinance establishes a process for investigating complaints naming the Chief of Police in Seattle.",
                    "The Office of Inspector General (OIG) will review misconduct complaints handled by the Office of Police Accountability (OPA) and audit areas involving conflicts of interest, fraud, waste, and abuse to maintain public trust in the criminal justice system.",
                    "Any complaint investigation that may lead to criminal charges against the Chief of Police will be referred to an outside investigator to avoid conflicts of interest.",
                    "The ordinance ensures that all provisions of the collective bargaining agreement remain in force for any City employee named in a complaint to OPA and governed by a collective bargaining agreement, and recognizes the need for ongoing review and improvement of the police oversight system to promote public confidence in the Seattle Police Department."],
        "link": "https://seattle.legistar.com/LegislationDetail.aspx?ID=5679570&GUID=D7D181BC-8D5D-4095-888A-E750F22C15D2&Options=ID%7CText%7C&Search=CB+120337&FullText=1", 
        "votes": [
            {
                "name": "Lisa Herbold",
                "vote": "Approve"
            },
            {
                "name": "Tammy J. Morales",
                "vote": "Approve"
            },
            {
                "name": "Kshama Sawant",
                "vote": "Reject"
            },
            {
                "name": "Alex Pedersen",
                "vote": "Approve"
            },
            {
                "name": "Debora Juarez",
                "vote": "Approve"
            },
            {
                "name": "Dan Strauss",
                "vote": "Approve"
            },
            {
                "name": "Andrew J. Lewis",
                "vote": "Approve"
            },
            {
                "name": "Teresa Mosqueda",
                "vote": "Approve"
            },
            {
                "name": "Sara Nelson",
                "vote": "Approve"
            }
        ],
        "decision": "Approve",
        "keywords": ["Police, Police Oversight, Complaints"],
        "bid": 3
    }
]